# Host: localhost  (Version: 5.0.51b-community-nt-log)
# Date: 2017-07-05 02:36:31
# Generator: MySQL-Front 5.3  (Build 4.9)

/*!40101 SET NAMES utf8 */;

#
# Source for table "address_book"
#

DROP TABLE IF EXISTS `address_book`;
CREATE TABLE `address_book` (
  `abid` int(11) NOT NULL auto_increment,
  `mobile` varchar(50) NOT NULL,
  `name` varchar(20) NOT NULL,
  `groupid` int(11) NOT NULL,
  `uid` varchar(20) NOT NULL,
  PRIMARY KEY  (`abid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

#
# Data for table "address_book"
#

/*!40000 ALTER TABLE `address_book` DISABLE KEYS */;
/*!40000 ALTER TABLE `address_book` ENABLE KEYS */;

#
# Source for table "area"
#

DROP TABLE IF EXISTS `area`;
CREATE TABLE `area` (
  `id` int(11) NOT NULL auto_increment,
  `title` varchar(100) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

#
# Data for table "area"
#

/*!40000 ALTER TABLE `area` DISABLE KEYS */;
INSERT INTO `area` VALUES (1,'其他'),(2,'北京'),(3,'重庆'),(4,'福建'),(5,'甘肃'),(6,'广东'),(7,'广西'),(8,'贵州'),(9,'海南'),(10,'河北'),(11,'黑龙江'),(12,'河南'),(13,'香港'),(14,'湖北'),(15,'湖南'),(16,'江苏'),(17,'江西'),(18,'吉林'),(19,'辽宁'),(20,'澳门'),(21,'内蒙古'),(22,'宁夏'),(23,'青海'),(24,'山东'),(25,'上海'),(26,'山西'),(27,'陕西'),(28,'四川'),(29,'台湾'),(30,'天津'),(31,'新疆'),(32,'西藏'),(33,'云南'),(34,'浙江'),(35,'安徽');
/*!40000 ALTER TABLE `area` ENABLE KEYS */;

#
# Source for table "areaplus"
#

DROP TABLE IF EXISTS `areaplus`;
CREATE TABLE `areaplus` (
  `id` int(11) NOT NULL auto_increment,
  `upid` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=427 DEFAULT CHARSET=utf8;

#
# Data for table "areaplus"
#

/*!40000 ALTER TABLE `areaplus` DISABLE KEYS */;
INSERT INTO `areaplus` VALUES (1,1,'其他'),(2,35,'合肥'),(3,35,'安庆'),(4,35,'蚌埠'),(5,35,'亳州'),(6,35,'巢湖'),(7,35,'滁州'),(8,35,'阜阳'),(9,35,'贵池'),(10,35,'淮北'),(11,35,'淮化'),(12,35,'淮南'),(13,35,'黄山'),(14,35,'九华山'),(15,35,'六安'),(16,35,'马鞍山'),(17,35,'宿州'),(18,35,'铜陵'),(19,35,'屯溪'),(20,35,'芜湖'),(21,35,'宣城'),(22,2,'北京'),(23,3,'重庆'),(24,4,'福州'),(25,4,'福安'),(26,4,'龙岩'),(27,4,'南平'),(28,4,'宁德'),(29,4,'莆田'),(30,4,'泉州'),(31,4,'三明'),(32,4,'邵武'),(33,4,'石狮'),(34,4,'永安'),(35,4,'武夷山'),(36,4,'厦门'),(37,4,'漳州'),(38,5,'兰州'),(39,5,'白银'),(40,5,'定西'),(41,5,'敦煌'),(42,5,'甘南'),(43,5,'金昌'),(44,5,'酒泉'),(45,5,'临夏'),(46,5,'平凉'),(47,5,'天水'),(48,5,'武都'),(49,5,'武威'),(50,5,'西峰'),(51,5,'张掖'),(52,6,'广州'),(53,6,'潮阳'),(54,6,'潮州'),(55,6,'澄海'),(56,6,'东莞'),(57,6,'佛山'),(58,6,'河源'),(59,6,'惠州'),(60,6,'江门'),(61,6,'揭阳'),(62,6,'开平'),(63,6,'茂名'),(64,6,'梅州'),(65,6,'清远'),(66,6,'汕头'),(67,6,'汕尾'),(68,6,'韶关'),(69,6,'深圳'),(70,6,'顺德'),(71,6,'阳江'),(72,6,'英德'),(73,6,'云浮'),(74,6,'增城'),(75,6,'湛江'),(76,6,'肇庆'),(77,6,'中山'),(78,6,'珠海'),(79,7,'南宁'),(80,7,'百色'),(81,7,'北海'),(82,7,'桂林'),(83,7,'防城港'),(84,7,'河池'),(85,7,'贺州'),(86,7,'柳州'),(87,7,'钦州'),(88,7,'梧州'),(89,7,'玉林'),(90,8,'贵阳'),(91,8,'安顺'),(92,8,'毕节'),(93,8,'都匀'),(94,8,'凯里'),(95,8,'六盘水'),(96,8,'铜仁'),(97,8,'兴义'),(98,8,'玉屏'),(99,8,'遵义'),(100,9,'海口'),(101,9,'儋县'),(102,9,'陵水'),(103,9,'琼海'),(104,9,'三亚'),(105,9,'五指山'),(106,9,'万宁'),(107,10,'石家庄'),(108,10,'保定'),(109,10,'北戴河'),(110,10,'沧州'),(111,10,'承德'),(112,10,'丰润'),(113,10,'邯郸'),(114,10,'衡水'),(115,10,'廊坊'),(116,10,'南戴河'),(117,10,'秦皇岛'),(118,10,'唐山'),(119,10,'新城'),(120,10,'邢台'),(121,10,'张家口'),(122,11,'哈尔滨'),(123,11,'北安'),(124,11,'大庆'),(125,11,'大兴安岭'),(126,11,'鹤岗'),(127,11,'黑河'),(128,11,'佳木斯'),(129,11,'鸡西'),(130,11,'牡丹江'),(131,11,'齐齐哈尔'),(132,11,'七台河'),(133,11,'双鸭山'),(134,11,'绥化'),(135,11,'伊春'),(136,12,'郑州'),(137,12,'安阳'),(138,12,'鹤壁'),(139,12,'潢川'),(140,12,'焦作'),(141,12,'济源'),(142,12,'开封'),(143,12,'漯河'),(144,12,'洛阳'),(145,12,'南阳'),(146,12,'平顶山'),(147,12,'濮阳'),(148,12,'三门峡'),(149,12,'商丘'),(150,12,'新乡'),(151,12,'信阳'),(152,12,'许昌'),(153,12,'周口'),(154,12,'驻马店'),(155,13,'香港'),(156,13,'九龙'),(157,13,'新界'),(158,14,'武汉'),(159,14,'恩施'),(160,14,'鄂州'),(161,14,'黄冈'),(162,14,'黄石'),(163,14,'荆门'),(164,14,'荆州'),(165,14,'潜江'),(166,14,'十堰'),(167,14,'随州'),(168,14,'武穴'),(169,14,'仙桃'),(170,14,'咸宁'),(171,14,'襄阳'),(172,14,'襄樊'),(173,14,'孝感'),(174,14,'宜昌'),(175,15,'长沙'),(176,15,'常德'),(177,15,'郴州'),(178,15,'衡阳'),(179,15,'怀化'),(180,15,'吉首'),(181,15,'娄底'),(182,15,'邵阳'),(183,15,'湘潭'),(184,15,'益阳'),(185,15,'岳阳'),(186,15,'永州'),(187,15,'张家界'),(188,15,'株洲'),(189,16,'南京'),(190,16,'常熟'),(191,16,'常州'),(192,16,'海门'),(193,16,'淮安'),(194,16,'江都'),(195,16,'江阴'),(196,16,'昆山'),(197,16,'连云港'),(198,16,'南通'),(199,16,'启东'),(200,16,'沭阳'),(201,16,'宿迁'),(202,16,'苏州'),(203,16,'太仓'),(204,16,'泰州'),(205,16,'同里'),(206,16,'无锡'),(207,16,'徐州'),(208,16,'盐城'),(209,16,'扬州'),(210,16,'宜兴'),(211,16,'仪征'),(212,16,'张家港'),(213,16,'镇江'),(214,16,'周庄'),(215,17,'南昌'),(216,17,'抚州'),(217,17,'赣州'),(218,17,'吉安'),(219,17,'景德镇'),(220,17,'井冈山'),(221,17,'九江'),(222,17,'庐山'),(223,17,'萍乡'),(224,17,'上饶'),(225,17,'新余'),(226,17,'宜春'),(227,17,'鹰潭'),(228,18,'长春'),(229,18,'白城'),(230,18,'白山'),(231,18,'珲春'),(232,18,'辽源'),(233,18,'梅河'),(234,18,'吉林'),(235,18,'四平'),(236,18,'松原'),(237,18,'通化'),(238,18,'延吉'),(239,19,'沈阳'),(240,19,'鞍山'),(241,19,'本溪'),(242,19,'朝阳'),(243,19,'大连'),(244,19,'丹东'),(245,19,'抚顺'),(246,19,'阜新'),(247,19,'葫芦岛'),(248,19,'锦州'),(249,19,'辽阳'),(250,19,'盘锦'),(251,19,'铁岭'),(252,19,'营口'),(253,20,'澳门'),(254,21,'呼和浩特'),(255,21,'阿拉善盟'),(256,21,'包头'),(257,21,'赤峰'),(258,21,'东胜'),(259,21,'海拉尔'),(260,21,'集宁'),(261,21,'临河'),(262,21,'通辽'),(263,21,'乌海'),(264,21,'乌兰浩特'),(265,21,'锡林浩特'),(266,22,'银川'),(267,22,'固原'),(268,22,'石嘴山'),(269,22,'吴忠'),(270,23,'西宁'),(271,23,'德令哈'),(272,23,'格尔木'),(273,23,'共和'),(274,23,'海东'),(275,23,'海晏'),(276,23,'玛沁'),(277,23,'同仁'),(278,23,'玉树'),(279,24,'济南'),(280,24,'滨州'),(281,24,'兖州'),(282,24,'德州'),(283,24,'东营'),(284,24,'菏泽'),(285,24,'济宁'),(286,24,'莱芜'),(287,24,'聊城'),(288,24,'临沂'),(289,24,'蓬莱'),(290,24,'青岛'),(291,24,'曲阜'),(292,24,'日照'),(293,24,'泰安'),(294,24,'潍坊'),(295,24,'威海'),(296,24,'烟台'),(297,24,'枣庄'),(298,24,'淄博'),(299,25,'上海'),(300,25,'崇明'),(301,25,'朱家角'),(302,26,'太原'),(303,26,'长治'),(304,26,'大同'),(305,26,'候马'),(306,26,'晋城'),(307,26,'离石'),(308,26,'临汾'),(309,26,'宁武'),(310,26,'朔州'),(311,26,'忻州'),(312,26,'阳泉'),(313,26,'榆次'),(314,26,'运城'),(315,27,'西安'),(316,27,'安康'),(317,27,'宝鸡'),(318,27,'汉中'),(319,27,'渭南'),(320,27,'商州'),(321,27,'绥德'),(322,27,'铜川'),(323,27,'咸阳'),(324,27,'延安'),(325,27,'榆林'),(326,28,'成都'),(327,28,'巴中'),(328,28,'达州'),(329,28,'德阳'),(330,28,'都江堰'),(331,28,'峨眉山'),(332,28,'涪陵'),(333,28,'广安'),(334,28,'广元'),(335,28,'九寨沟'),(336,28,'康定'),(337,28,'乐山'),(338,28,'泸州'),(339,28,'马尔康'),(340,28,'绵阳'),(341,28,'眉山'),(342,28,'南充'),(343,28,'内江'),(344,28,'攀枝花'),(345,28,'遂宁'),(346,28,'汶川'),(347,28,'西昌'),(348,28,'雅安'),(349,28,'宜宾'),(350,28,'自贡'),(351,28,'资阳'),(352,29,'台北'),(353,29,'基隆'),(354,29,'台南'),(355,29,'台中'),(356,30,'天津'),(357,31,'乌鲁木齐'),(358,31,'阿克苏'),(359,31,'阿勒泰'),(360,31,'阿图什'),(361,31,'博乐'),(362,31,'昌吉'),(363,31,'东山'),(364,31,'哈密'),(365,31,'和田'),(366,31,'喀什'),(367,31,'克拉玛依'),(368,31,'库车'),(369,31,'库尔勒'),(370,31,'奎屯'),(371,31,'石河子'),(372,31,'塔城'),(373,31,'吐鲁番'),(374,31,'伊宁'),(375,32,'拉萨'),(376,32,'阿里'),(377,32,'昌都'),(378,32,'林芝'),(379,32,'那曲'),(380,32,'日喀则'),(381,32,'山南'),(382,33,'昆明'),(383,33,'大理'),(384,33,'保山'),(385,33,'楚雄'),(386,33,'东川'),(387,33,'个旧'),(388,33,'景洪'),(389,33,'开远'),(390,33,'临沧'),(391,33,'丽江'),(392,33,'六库'),(393,33,'潞西'),(394,33,'曲靖'),(395,33,'思茅'),(396,33,'文山'),(397,33,'西双版纳'),(398,33,'玉溪'),(399,33,'中甸'),(400,33,'昭通'),(401,34,'杭州'),(402,34,'安吉'),(403,34,'慈溪'),(404,34,'定海'),(405,34,'奉化'),(406,34,'海盐'),(407,34,'黄岩'),(408,34,'湖州'),(409,34,'嘉兴'),(410,34,'金华'),(411,34,'临安'),(412,34,'临海'),(413,34,'丽水'),(414,34,'宁波'),(415,34,'瓯海'),(416,34,'平湖'),(417,34,'千岛湖'),(418,34,'衢州'),(419,34,'江山'),(420,34,'瑞安'),(421,34,'绍兴'),(422,34,'嵊州'),(423,34,'台州'),(424,34,'温岭'),(425,34,'温州'),(426,34,'舟山');
/*!40000 ALTER TABLE `areaplus` ENABLE KEYS */;

#
# Source for table "book_group"
#

DROP TABLE IF EXISTS `book_group`;
CREATE TABLE `book_group` (
  `gid` int(11) NOT NULL auto_increment,
  `title` varchar(100) NOT NULL,
  `description` text,
  `uid` varchar(20) NOT NULL,
  PRIMARY KEY  (`gid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

#
# Data for table "book_group"
#

/*!40000 ALTER TABLE `book_group` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_group` ENABLE KEYS */;

#
# Source for table "message"
#

DROP TABLE IF EXISTS `message`;
CREATE TABLE `message` (
  `mid` int(11) NOT NULL auto_increment,
  `content` varchar(128) NOT NULL,
  `mobile` text NOT NULL,
  `status_flag` int(11) NOT NULL,
  `post_date` datetime NOT NULL,
  `uid` varchar(20) NOT NULL,
  PRIMARY KEY  (`mid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

#
# Data for table "message"
#

/*!40000 ALTER TABLE `message` DISABLE KEYS */;
/*!40000 ALTER TABLE `message` ENABLE KEYS */;

#
# Source for table "user"
#

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `userid` varchar(20) NOT NULL,
  `real_name` varchar(20) NOT NULL,
  `password` varchar(32) NOT NULL,
  `question` varchar(50) NOT NULL,
  `answer` varchar(50) NOT NULL,
  `sex` varchar(2) NOT NULL,
  `mobile` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `last_login_date` datetime default NULL,
  `post_date` datetime NOT NULL,
  `area_id` int(11) NOT NULL default '1',
  `areaplus_id` int(11) NOT NULL default '1',
  PRIMARY KEY  (`userid`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

#
# Data for table "user"
#

/*!40000 ALTER TABLE `user` DISABLE KEYS */;
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
